package com.bceden.basic;

public class ShortTest {

	public static void main(String[] args) {
//
//		
//		short b= 1;
//		short c = b+1;
		
		byte b = 120;   //(最小值-128 最大值127)
		
//		
//		 一个常量，保存 byte 类型可取的最大值，即 27-1。(127) 
//		 一个常量，保存 byte 类型可取的最小值，即 -27。(-128)  
//		 
//		 --------------------------------------------------- 
//		 short s;//指定变量s为short型  
//		 保存 short 可取的最大值的常量，最大值为 215-1。（32 767） 
//		 保存 short 可取的最小值的常量，最小值为 -215。（-32 768） 
//		 
//		 --------------------------------------------------- 
//		int i;//指定变量i为int型 
//		 值为 231－1 的常量，它表示 int 类型能够表示的最大值。 
//		 值为 －231 的常量，它表示 int 类型能够表示的最小值。 
//		 
//		 --------------------------------------------------- 
//		 long l;//指定变量l为long型 
//		 保持 long 类型的最大值的常量，该值为 263-1。 
//		 保持 long 类型的最小值的常量，该值为 -263。
		
	}

}
